// Выбрать все товары, которые мы хоть раз продавали, но сейчас их нет в наличии на складе 
ВЫБРАТЬ
	рАналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
ПОМЕСТИТЬ ВТ_ТоварыКоторыеПродавали
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК рАналитикаУчетаНоменклатуры
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры = рАналитикаУчетаНоменклатуры.КлючАналитики

ИНДЕКСИРОВАТЬ ПО
	Номенклатура
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ТоварыКоторыеПродавали.Номенклатура КАК Номенклатура
ИЗ
	ВТ_ТоварыКоторыеПродавали КАК ВТ_ТоварыКоторыеПродавали
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		ПО ВТ_ТоварыКоторыеПродавали.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
ГДЕ
	ТоварыНаСкладахОстатки.Номенклатура ЕСТЬ NULL

СГРУППИРОВАТЬ ПО
	ВТ_ТоварыКоторыеПродавали.Номенклатура
