ВЫБРАТЬ
	СправочникНоменклатура.Ссылка КАК ТоварыСПродажами
ПОМЕСТИТЬ ВТТоварыСПродажами
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
ГДЕ
	ВыручкаИСебестоимостьПродаж.СуммаВыручки > 0
	И СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)

СГРУППИРОВАТЬ ПО
	СправочникНоменклатура.Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТТоварыСПродажами.ТоварыСПродажами КАК ТоварыСПродажами
ИЗ
	ВТТоварыСПродажами КАК ВТТоварыСПродажами
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ТекущаяДата, ) КАК ТоварыНаСкладахОстатки
		ПО ВТТоварыСПродажами.ТоварыСПродажами = ТоварыНаСкладахОстатки.Номенклатура
ГДЕ
	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) = 0
