// Выбрать все товары, которые мы хоть раз продавали, но сейчас их нет в наличии на складе 

ВЫБРАТЬ
	рАналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
ПОМЕСТИТЬ ВТ_ТоварыКоторыеПродавали
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК рАналитикаУчетаНоменклатуры
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры = рАналитикаУчетаНоменклатуры.КлючАналитики

ИНДЕКСИРОВАТЬ ПО
	Номенклатура
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
ПОМЕСТИТЬ ВТ_ТоварыВНаличии
ИЗ
	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки

ИНДЕКСИРОВАТЬ ПО
	Номенклатура
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ТоварыКоторыеПродавали.Номенклатура КАК Номенклатура
ИЗ
	ВТ_ТоварыКоторыеПродавали КАК ВТ_ТоварыКоторыеПродавали
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыВНаличии КАК ВТ_ТоварыВНаличии
		ПО ВТ_ТоварыКоторыеПродавали.Номенклатура = ВТ_ТоварыВНаличии.Номенклатура
ГДЕ
	ВТ_ТоварыВНаличии.Номенклатура ЕСТЬ NULL

СГРУППИРОВАТЬ ПО
	ВТ_ТоварыКоторыеПродавали.Номенклатура
