//Получить запросом всех клиентов, которые ничего не покупали больше года

//Вариант 1 (под клиентом подразумеваем пратнера, который хоть раз что-то покупал)
ВЫБРАТЬ
	рАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	МАКСИМУМ(ВыручкаИСебестоимостьПродаж.Период) КАК Период
ПОМЕСТИТЬ ВТ_ДатыПоследнихПродаж
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК рАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = рАналитикаУчетаПоПартнерам.КлючАналитики

СГРУППИРОВАТЬ ПО
	рАналитикаУчетаПоПартнерам.Партнер
;
////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ДатыПоследнихПродаж.Партнер КАК Партнер
ИЗ
	ВТ_ДатыПоследнихПродаж КАК ВТ_ДатыПоследнихПродаж
ГДЕ
	ВТ_ДатыПоследнихПродаж.Период < ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, МЕСЯЦ, -12)

//Вариант 2(под клиентом подразумеваем пратнера, который хоть раз что-то покупал)
ВЫБРАТЬ РАЗЛИЧНЫЕ
	РАналитикаУчетаПоПартнерам.Партнер КАК Партнер
ПОМЕСТИТЬ ВТ_ВсеКлиенты
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = РАналитикаУчетаПоПартнерам.КлючАналитики
ГДЕ
	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот > 0

ИНДЕКСИРОВАТЬ ПО
	Партнер
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗЛИЧНЫЕ
	РАналитикаУчетаПоПартнерам.Партнер КАК Партнер
ПОМЕСТИТЬ ВТ_КлиентыЗаПоследнийГод
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, МЕСЯЦ, -12), &ТекущаяДатаСеанса, , ) КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = РАналитикаУчетаПоПартнерам.КлючАналитики
ГДЕ
	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот > 0

ИНДЕКСИРОВАТЬ ПО
	Партнер
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ВсеКлиенты.Партнер КАК Партнер
ИЗ
	ВТ_ВсеКлиенты КАК ВТ_ВсеКлиенты
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлиентыЗаПоследнийГод КАК ВТ_КлиентыЗаПоследнийГод
		ПО ВТ_ВсеКлиенты.Партнер = ВТ_КлиентыЗаПоследнийГод.Партнер
ГДЕ
	ВТ_КлиентыЗаПоследнийГод.Партнер ЕСТЬ NULL
