//Получить запросом всех клиентов, которые ничего не покупали больше года

//Вариант 1 (под клиентом подразумеваем пратнера, который хоть раз что-то покупал)
ВЫБРАТЬ
	рАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	МАКСИМУМ(ВыручкаИСебестоимостьПродаж.Период) КАК Период
ПОМЕСТИТЬ ВТ_ДатыПоследнихПродаж
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК рАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = рАналитикаУчетаПоПартнерам.КлючАналитики

СГРУППИРОВАТЬ ПО
	рАналитикаУчетаПоПартнерам.Партнер
;
////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_ДатыПоследнихПродаж.Партнер КАК Партнер
ИЗ
	ВТ_ДатыПоследнихПродаж КАК ВТ_ДатыПоследнихПродаж
ГДЕ
	ВТ_ДатыПоследнихПродаж.Период < ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -12)
