ВЫБРАТЬ
	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ рАналитикаУчетаНоменклатуры.Номенклатура) КАК КоличествоПозиций,
	рАналитикаУчетаПоПартнерам.Партнер КАК Партнер
ПОМЕСТИТЬ ВТКоличествоПозицийПоПартнерам
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК рАналитикаУчетаНоменклатуры
		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = рАналитикаУчетаНоменклатуры.КлючАналитики
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК рАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = рАналитикаУчетаПоПартнерам.КлючАналитики

СГРУППИРОВАТЬ ПО
	рАналитикаУчетаПоПартнерам.Партнер
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ ПЕРВЫЕ 3
	ВТКоличествоПозицийПоПартнерам.Партнер КАК Партнер
ИЗ
	ВТКоличествоПозицийПоПартнерам КАК ВТКоличествоПозицийПоПартнерам

УПОРЯДОЧИТЬ ПО
	ВТКоличествоПозицийПоПартнерам.КоличествоПозиций УБЫВ
