// Выбрать ТОП-3 клиентов, но теперь тех, кто купил как можно больше разных наименований товаров

ВЫБРАТЬ ПЕРВЫЕ 3
	рАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура) КАК ВариантыНоменклатуры
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК рАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = рАналитикаУчетаПоПартнерам.КлючАналитики

СГРУППИРОВАТЬ ПО
	рАналитикаУчетаПоПартнерам.Партнер

УПОРЯДОЧИТЬ ПО
	ВариантыНоменклатуры УБЫВ
