ВЫБРАТЬ
	рАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	СУММА(ВыручкаИСебестоимостьПродаж.СуммаВыручки) КАК СуммаВыручки
ПОМЕСТИТЬ ВТВыручкаПоПартнерам
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК рАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаПоПартнерам = рАналитикаУчетаПоПартнерам.КлючАналитики
ГДЕ
	ВыручкаИСебестоимостьПродаж.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -12) И &ТекущаяДата
СГРУППИРОВАТЬ ПО
	рАналитикаУчетаПоПартнерам.Партнер
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ ПЕРВЫЕ 3
	ВТВыручкаПоПартнерам.Партнер КАК Партнер
ИЗ
	ВТВыручкаПоПартнерам КАК ВТВыручкаПоПартнерам
УПОРЯДОЧИТЬ ПО
	ВТВыручкаПоПартнерам.СуммаВыручки УБЫВ
