// Получить запросом все "популярные" товары, которы закончились на складе
// Популярным товар считаем, если в прошлом месяце его купили более х раз

ВЫБРАТЬ
	СправочникНоменклатура.Ссылка КАК ПопулярныеТовары
ПОМЕСТИТЬ ВТПопулярныеТовары
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ГОД, -1), &ТекущаяДатаСеанса, Регистратор, ) КАК ВыручкаИСебестоимостьПродажОбороты
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
ГДЕ
	СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	И ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот > 0

СГРУППИРОВАТЬ ПО
	СправочникНоменклатура.Ссылка

ИМЕЮЩИЕ
	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВыручкаИСебестоимостьПродажОбороты.Регистратор) > &Храз
;
////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТПопулярныеТовары.ПопулярныеТовары КАК ПопулярныеТоварыНеВНаличии
ИЗ
	ВТПопулярныеТовары КАК ВТПопулярныеТовары
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&ТекущаяДатаСеанса, ) КАК ТоварыНаСкладахОстатки
		ПО ВТПопулярныеТовары.ПопулярныеТовары = ТоварыНаСкладахОстатки.Номенклатура
ГДЕ
	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) = 0

