ВЫБРАТЬ
	рАналитикаУчетаПоПартнерам.Партнер КАК ПартнерыАиБ,
	СправочникНоменклатура.Ссылка КАК ТоварыАиБ
ПОМЕСТИТЬ ВТКупилиАиБ
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -12), &Текущаядата, , АналитикаУчетаНоменклатуры.Номенклатура В (&ТоварА, &ТоварБ)) КАК ВыручкаИСебестоимостьПродажОбороты
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК рАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = рАналитикаУчетаПоПартнерам.КлючАналитики
		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура = СправочникНоменклатура.Ссылка
ГДЕ
	СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	И ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот > 0

СГРУППИРОВАТЬ ПО
	рАналитикаУчетаПоПартнерам.Партнер,
	СправочникНоменклатура.Ссылка
;	
////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТКупилиАиБ.ПартнерыАиБ КАК ПартнерыА
ПОМЕСТИТЬ ВТКупилиА
ИЗ
	ВТКупилиАиБ КАК ВТКупилиАиБ
ГДЕ
	ВТКупилиАиБ.ТоварыАиБ = &ТоварА

СГРУППИРОВАТЬ ПО
	ВТКупилиАиБ.ПартнерыАиБ 
;
////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТКупилиАиБ.ПартнерыАиБ КАК ПартнерыБ
ПОМЕСТИТЬ ВТКупилиБ
ИЗ
	ВТКупилиАиБ КАК ВТКупилиАиБ
ГДЕ
	ВТКупилиАиБ.ТоварыАиБ = &ТоварБ

СГРУППИРОВАТЬ ПО
	ВТКупилиАиБ.ПартнерыАиБ
;
////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТКупилиА.ПартнерыА КАК ПартнерыАнеБ
ИЗ
	ВТКупилиА КАК ВТКупилиА
		ЛЕВОЕ СОЕДИНЕНИЕ ВТКупилиБ КАК ВТКупилиБ
		ПО ВТКупилиА.ПартнерыА = ВТКупилиБ.ПартнерыБ
ГДЕ
	ВТКупилиБ.ПартнерыБ ЕСТЬ NULL
