//запрос, который покажет всех клиентов, купивших товар А, но не купивших Товар Б

// Используем справочник КлючиАналитики... вместо регистра сведений,
// потому что он уже содержит готовый набор всех разрезов аналитики
// (номенклатура, характеристика, склад и т.д.) в виде реквизитов.
// Одно соединение вместо нескольких — проще и быстрее (по сравнению с регистром сведений аналитики)

ВЫБРАТЬ РАЗЛИЧНЫЕ
	КлючиАналитикиУчетаПоПартнерам.Партнер КАК Партнер
ПОМЕСТИТЬ ВТ_КупившиеА
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
			,
			,
			,
			АналитикаУчетаНоменклатуры В
				(ВЫБРАТЬ
					КлючиАналитикиУчетаНоменклатуры.Ссылка КАК Ссылка
				ИЗ
					Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
				ГДЕ
					КлючиАналитикиУчетаНоменклатуры.Номенклатура = &ТоварА)) КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка

ИНДЕКСИРОВАТЬ ПО
	Партнер
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ РАЗЛИЧНЫЕ
	КлючиАналитикиУчетаПоПартнерам.Партнер КАК Партнер
ПОМЕСТИТЬ ВТ_КупившиеБ
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
			,
			,
			,
			АналитикаУчетаНоменклатуры В
				(ВЫБРАТЬ
					КлючиАналитикиУчетаНоменклатуры.Ссылка КАК Ссылка
				ИЗ
					Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
				ГДЕ
					КлючиАналитикиУчетаНоменклатуры.Номенклатура = &ТоварБ)) КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВТ_КупившиеА.Партнер КАК Партнер
ИЗ
	ВТ_КупившиеА КАК ВТ_КупившиеА
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КупившиеБ КАК ВТ_КупившиеБ
		ПО ВТ_КупившиеА.Партнер = ВТ_КупившиеБ.Партнер
ГДЕ
	ВТ_КупившиеБ.Партнер ЕСТЬ NULL
