&НаКлиенте
Процедура ПроверитьКоличество(Команда)
	
	НазваниеДокумента = "РеализацияТовара";
	Сообщить(КоличествоДокументов(НазваниеДокумента));
	
КонецПроцедуры

&НаСервере
Функция КоличествоДокументов(ИмяДокумента)
	
	//Проверки, если значение не введено или такого док-та не существует
	Если ПустаяСтрока(ИмяДокумента) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Метаданные.Документы.Найти(ИмяДокумента) = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	//текст запроса, в который будет подставлено значение
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоДокументов
	|ИЗ
	|	&НужныеДокументы КАК ЭтиДокументы";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&НужныеДокументы", "Документ." + ИмяДокумента);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КоличествоДокументов;

КонецФункции
