//Регистр который используем - РС Номенклатура, продаваемая совместно
//Создадим отчет, который покажет клиентов, которые за указанный период (например прошлый месяц) купили основной товар (Принтер) но не купили у нас сопутствующий товар (картридж)
//По шагам:
// 1. ВТПроданныеТоварыСопутствующие : создаем таблицу со всеми парами Основной и Сопутствующий
// 2. ВТПродажиЗаПериод : создаем таблицу с партнером, товаром, днем покупки по всем продажам за период
// 3. ВТПроданныеТоварыОсновные : выбираем из ВТПродажиЗаПериод проданные Основные товары и партнеров только по сделкам где был куплен Основной товар
// 4. ВТПроданныеТоварыСопутствующие : выбираем из ВТПродажиЗаПериод проданные Основные товары и партнеров только по сделкам где был куплен Сопутствующий товар
// 5. Итоговый : выбираем все сделки, где был куплен Основной товар и сделки где был куплен Сопутствующий товар, в которых у проданного Сопутствующего товара такая же пара по Основному товару и одновременно  также совпадает партнер. 
// 		По условию в ГДЕ отсекли тех, у кого такое совпадение нашлось


ВЫБРАТЬ
	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка КАК ОсновнойТовар,
	НоменклатураПродаваемаяСовместно.НоменклатураСледствие КАК СопутствующийТовар
ПОМЕСТИТЬ с
ИЗ
	РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
ГДЕ
	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка ЕСТЬ НЕ NULL // Это чтобы выбрать только полные пары для решения задачи
	И НоменклатураПродаваемаяСовместно.НоменклатураСледствие ЕСТЬ НЕ NULL // Это чтобы выбрать только полные пары для решения задачи

СГРУППИРОВАТЬ ПО
	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка,
	НоменклатураПродаваемаяСовместно.НоменклатураСледствие
;
////////////////////////////////////////////////////////////////////////////////

ВЫБРАТЬ
	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Товары,
	РСАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	ВыручкаИСебестоимостьПродажОбороты.Период КАК ДеньПокупкиОсновногоТовара
ПОМЕСТИТЬ ВТПродажиЗаПериод
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -1), &ТекущаяДата, ДЕНЬ, ) КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РСАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = РСАналитикаУчетаПоПартнерам.КлючАналитики
ГДЕ
	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот > 0

СГРУППИРОВАТЬ ПО
	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
	РСАналитикаУчетаПоПартнерам.Партнер,
	ВыручкаИСебестоимостьПродажОбороты.Период
;
////////////////////////////////////////////////////////////////////////////////

ВЫБРАТЬ
	ВТПродажиЗаПериод.Партнер КАК Партнер,
	ВТОсновныеИСопутствующие.ОсновнойТовар КАК ОсновнойТовар,
	ВТПродажиЗаПериод.ДеньПокупкиОсновногоТовара КАК ДеньПокупкиОсновногоТовара
ПОМЕСТИТЬ ВТПроданныеТоварыОсновные
ИЗ
	ВТПродажиЗаПериод КАК ВТПродажиЗаПериод
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеИСопутствующие КАК ВТОсновныеИСопутствующие
		ПО ВТПродажиЗаПериод.Товары = ВТОсновныеИСопутствующие.ОсновнойТовар

СГРУППИРОВАТЬ ПО
	ВТПродажиЗаПериод.Партнер,
	ВТОсновныеИСопутствующие.ОсновнойТовар,
	ВТПродажиЗаПериод.ДеньПокупкиОсновногоТовара
;
////////////////////////////////////////////////////////////////////////////////

ВЫБРАТЬ
	ВТПродажиЗаПериод.Партнер КАК ПартнерСопутствующие,
	ВТОсновныеИСопутствующие.ОсновнойТовар КАК ОсновнойТовар
ПОМЕСТИТЬ ВТПроданныеТоварыСопутствующие
ИЗ
	ВТПродажиЗаПериод КАК ВТПродажиЗаПериод
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеИСопутствующие КАК ВТОсновныеИСопутствующие
		ПО ВТПродажиЗаПериод.Товары = ВТОсновныеИСопутствующие.СопутствующийТовар // Здесь мы создаем таблицу Партнер и Основной товар из дней продаж за период, в которые также был продан Сопутствующий товар

СГРУППИРОВАТЬ ПО
	ВТПродажиЗаПериод.Партнер,
	ВТОсновныеИСопутствующие.ОсновнойТовар
;
////////////////////////////////////////////////////////////////////////////////

ВЫБРАТЬ
	ВТПроданныеТоварыОсновные.Партнер КАК Партнер,
	ВТПроданныеТоварыОсновные.ОсновнойТовар КАК ОсновнойТовар,
	ВТПроданныеТоварыОсновные.ДеньПокупкиОсновногоТовара КАК ДеньПокупкиОсновногоТовара,
	ВТОсновныеИСопутствующие.СопутствующийТовар КАК СопутствующийТоварНеКупленный
ИЗ
	ВТПроданныеТоварыОсновные КАК ВТПроданныеТоварыОсновные
		ЛЕВОЕ СОЕДИНЕНИЕ ВТПроданныеТоварыСопутствующие КАК ВТПроданныеТоварыСопутствующие
		ПО ВТПроданныеТоварыОсновные.ОсновнойТовар = ВТПроданныеТоварыСопутствующие.ОсновнойТовар
			И ВТПроданныеТоварыОсновные.Партнер = ВТПроданныеТоварыСопутствующие.ПартнерСопутствующие // "Соединяй покупку Принтера и покупку Картриджа только если их купил один и тот же партнер
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеИСопутствующие КАК ВТОсновныеИСопутствующие // Это соединение нужно чтобы отразить Сопутствующий, которые не был кпулен
		ПО ВТПроданныеТоварыОсновные.ОсновнойТовар = ВТОсновныеИСопутствующие.ОсновнойТовар
ГДЕ
	ВТПроданныеТоварыСопутствующие.ПартнерСопутствующие ЕСТЬ NULL



