ВЫБРАТЬ
	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка КАК ОсновнойТовар,
	НоменклатураПродаваемаяСовместно.НоменклатураСледствие КАК СопутствующийТовар
ПОМЕСТИТЬ ВТОсновныеИСопутствующие
ИЗ
	РегистрСведений.НоменклатураПродаваемаяСовместно КАК НоменклатураПродаваемаяСовместно
ГДЕ
	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка ЕСТЬ НЕ NULL 
	И НоменклатураПродаваемаяСовместно.НоменклатураСледствие ЕСТЬ НЕ NULL 

СГРУППИРОВАТЬ ПО
	НоменклатураПродаваемаяСовместно.НоменклатураПредпосылка,
	НоменклатураПродаваемаяСовместно.НоменклатураСледствие
;
////////////////////////////////////////////////////////////////////////////////

ВЫБРАТЬ
	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Товары,
	РСАналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	ВыручкаИСебестоимостьПродажОбороты.Период КАК ДеньПокупкиОсновногоТовара
ПОМЕСТИТЬ ВТПродажиЗаПериод
ИЗ
	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, -1), &ТекущаяДата, ДЕНЬ, ) КАК ВыручкаИСебестоимостьПродажОбороты
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РСАналитикаУчетаПоПартнерам
		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаПоПартнерам = РСАналитикаУчетаПоПартнерам.КлючАналитики
ГДЕ
	ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот > 0

СГРУППИРОВАТЬ ПО
	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
	РСАналитикаУчетаПоПартнерам.Партнер,
	ВыручкаИСебестоимостьПродажОбороты.Период
;
////////////////////////////////////////////////////////////////////////////////

ВЫБРАТЬ
	ВТПродажиЗаПериод.Партнер КАК Партнер,
	ВТОсновныеИСопутствующие.ОсновнойТовар КАК ОсновнойТовар,
	ВТПродажиЗаПериод.ДеньПокупкиОсновногоТовара КАК ДеньПокупкиОсновногоТовара
ПОМЕСТИТЬ ВТПроданныеТоварыОсновные
ИЗ
	ВТПродажиЗаПериод КАК ВТПродажиЗаПериод
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеИСопутствующие КАК ВТОсновныеИСопутствующие
		ПО ВТПродажиЗаПериод.Товары = ВТОсновныеИСопутствующие.ОсновнойТовар

СГРУППИРОВАТЬ ПО
	ВТПродажиЗаПериод.Партнер,
	ВТОсновныеИСопутствующие.ОсновнойТовар,
	ВТПродажиЗаПериод.ДеньПокупкиОсновногоТовара
;
////////////////////////////////////////////////////////////////////////////////

ВЫБРАТЬ
	ВТПродажиЗаПериод.Партнер КАК ПартнерСопутствующие,
	ВТОсновныеИСопутствующие.ОсновнойТовар КАК ОсновнойТовар
ПОМЕСТИТЬ ВТПроданныеТоварыСопутствующие
ИЗ
	ВТПродажиЗаПериод КАК ВТПродажиЗаПериод
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеИСопутствующие КАК ВТОсновныеИСопутствующие
		ПО ВТПродажиЗаПериод.Товары = ВТОсновныеИСопутствующие.СопутствующийТовар

СГРУППИРОВАТЬ ПО
	ВТПродажиЗаПериод.Партнер,
	ВТОсновныеИСопутствующие.ОсновнойТовар
;
////////////////////////////////////////////////////////////////////////////////

ВЫБРАТЬ
	ВТПроданныеТоварыОсновные.Партнер КАК Партнер,
	ВТПроданныеТоварыОсновные.ОсновнойТовар КАК ОсновнойТовар,
	ВТПроданныеТоварыОсновные.ДеньПокупкиОсновногоТовара КАК ДеньПокупкиОсновногоТовара,
	ВТОсновныеИСопутствующие.СопутствующийТовар КАК СопутствующийТовар
ИЗ
	ВТПроданныеТоварыОсновные КАК ВТПроданныеТоварыОсновные
		ЛЕВОЕ СОЕДИНЕНИЕ ВТПроданныеТоварыСопутствующие КАК ВТПроданныеТоварыСопутствующие
		ПО ВТПроданныеТоварыОсновные.ОсновнойТовар = ВТПроданныеТоварыСопутствующие.ОсновнойТовар
			И ВТПроданныеТоварыОсновные.Партнер = ВТПроданныеТоварыСопутствующие.ПартнерСопутствующие
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОсновныеИСопутствующие КАК ВТОсновныеИСопутствующие
		ПО ВТПроданныеТоварыОсновные.ОсновнойТовар = ВТОсновныеИСопутствующие.ОсновнойТовар
ГДЕ
	ВТПроданныеТоварыСопутствующие.ПартнерСопутствующие ЕСТЬ NULL
