ВЫБРАТЬ
	ПриобретениеТоваровУслуг.Дата КАК Дата,
	ПриобретениеТоваровУслуг.Валюта КАК Валюта,
	МАКСИМУМ(КурсыВалют.Период) КАК Период,
	ПриобретениеТоваровУслуг.Ссылка КАК Документ
ПОМЕСТИТЬ МаксимальныеКурсовыеДаты
ИЗ
	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		ПО ПриобретениеТоваровУслуг.Валюта = КурсыВалют.Валюта
			И (КурсыВалют.Период <= КОНЕЦПЕРИОДА(ПриобретениеТоваровУслуг.Дата, ДЕНЬ))

СГРУППИРОВАТЬ ПО
	ПриобретениеТоваровУслуг.Дата,
	ПриобретениеТоваровУслуг.Валюта,
	ПриобретениеТоваровУслуг.Ссылка
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ПРЕДСТАВЛЕНИЕССЫЛКИ(МаксимальныеКурсовыеДаты.Документ) КАК ДокументПредставление,
	МаксимальныеКурсовыеДаты.Дата КАК Дата,
	МаксимальныеКурсовыеДаты.Валюта КАК Валюта,
	ЕСТЬNULL(КурсыВалют.Курс, 0) КАК КурсВалютыНаДату
ИЗ
	МаксимальныеКурсовыеДаты КАК МаксимальныеКурсовыеДаты
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		ПО МаксимальныеКурсовыеДаты.Период = КурсыВалют.Период
			И МаксимальныеКурсовыеДаты.Валюта = КурсыВалют.Валюта

УПОРЯДОЧИТЬ ПО
	Дата
