// Для каждого документа поступления вывести:
// -сам документ, -дата документа, -валюта документа,-курс валюты на дату документа

// Данные нужно получить одним запросом
// Курсы валют берем из РС Курсы валют
// Доку-т: Приобретение товаров и услуг
// Курс может меняться не каждый день Мы должны получить именно последний установленнй курс актуальный на дату док-та

ВЫБРАТЬ
	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.Ссылка) КАК Документ,
	ВложенныйЗапрос.Дата КАК Дата,
	ВложенныйЗапрос.Валюта КАК Валюта,
	ЕСТЬNULL(КурсыВалют.Курс, 1) КАК КурсВалютыНаДату
ИЗ
	(ВЫБРАТЬ
		ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
		ПриобретениеТоваровУслуг.Валюта КАК Валюта,
		ПриобретениеТоваровУслуг.Дата КАК Дата,
		МАКСИМУМ(КурсыВалют.Период) КАК Период
	ИЗ
		Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
			ПО ПриобретениеТоваровУслуг.Валюта = КурсыВалют.Валюта
				И (КурсыВалют.Период <= ПриобретениеТоваровУслуг.Дата)
	
	СГРУППИРОВАТЬ ПО
		ПриобретениеТоваровУслуг.Ссылка,
		ПриобретениеТоваровУслуг.Валюта,
		ПриобретениеТоваровУслуг.Дата) КАК ВложенныйЗапрос
		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		ПО ВложенныйЗапрос.Валюта = КурсыВалют.Валюта
			И ВложенныйЗапрос.Период = КурсыВалют.Период
