// Проверяем иерархию номенклатуры

// Пример справочника Номенклатура
// -- Папка 1
// ---Папка 2.1
// -------Папка 3
// ---------Папка 4
// ---------------Товар1
// ---------------Товар2
// ---Папка 2.2

// Требуется написать запрос, который для переданных товаров вернет всех родителей (включая вышестоящие уровни) + уровень вложенности. Если папка - это родитель товара, то уровень вложенности 1, если это родитель родителя - уровень 2 и так далее
// Например результат для Товара 1
// Папка 4 - 1
// Папка 3 - 2
// Папка 2.1 -3
// Папка 1 - 4

// Понятно, что это все можно обойти перебором родителей в коде в цикле, но давайте попробуем получить данные одним запросом


ВЫБРАТЬ
	Товары.Значение КАК Товар
ПОМЕСТИТЬ ВТТовары
ИЗ
	&Товары КАК Товары
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Номенклатура.Ссылка КАК Товар,
	Номенклатура.Родитель КАК Папка,
	1 КАК Уровень
ПОМЕСТИТЬ ВТПапкиСУровнями
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель,
	2
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель,
	3
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель.Родитель,
	4
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель,
	5
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
	6
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
	7
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТПапкиСУровнями.Товар) КАК Товар,
	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТПапкиСУровнями.Папка) КАК Папка,
	ВТПапкиСУровнями.Уровень КАК Уровень
ИЗ
	ВТПапкиСУровнями КАК ВТПапкиСУровнями

УПОРЯДОЧИТЬ ПО
	ВТПапкиСУровнями.Товар,
	Уровень
