ВЫБРАТЬ
	Товары.Значение КАК Товар
ПОМЕСТИТЬ ВТТовары
ИЗ
	&Товары КАК Товары
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Номенклатура.Ссылка КАК Товар,
	Номенклатура.Родитель КАК Папка,
	1 КАК Уровень
ПОМЕСТИТЬ ВТПапкиСУровнями
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель,
	2
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель,
	3
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель.Родитель,
	4
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель,
	5
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
	6
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)

ОБЪЕДИНИТЬ ВСЕ

ВЫБРАТЬ
	Номенклатура.Ссылка,
	Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель,
	7
ИЗ
	Справочник.Номенклатура КАК Номенклатура
ГДЕ
	Номенклатура.Ссылка В (ВЫБРАТЬ ВТТовары.Товар ИЗ ВТТовары)
	И Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТПапкиСУровнями.Товар) КАК Товар,
	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТПапкиСУровнями.Папка) КАК Папка,
	ВТПапкиСУровнями.Уровень КАК Уровень
ИЗ
	ВТПапкиСУровнями КАК ВТПапкиСУровнями

УПОРЯДОЧИТЬ ПО
	ВТПапкиСУровнями.Товар,
	Уровень
