
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СвободныеОстатки Приход
	Движения.СвободныеОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаТабличнаяТовары Из ТабличнаяТовары Цикл
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТабличнаяТовары.Товар;
		Движение.СрокГодности = ТекСтрокаТабличнаяТовары.СрокГодности;
		Движение.Количество = ТекСтрокаТабличнаяТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
