 
 // -Автоматический расчет суммы-
 // Чтобы при изменении количества автоматически считалась сумма
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
		
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
    	
КонецПроцедуры

 // Чтобы при изменении количества автоматически считалась сумма 
 &НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры



// - Сроки годности -
 //Получаем все доступные сроки по товару на момент документа - добавляем в массив
&НаСервере
Функция ПолучитьДоступныеСрокиГодности(Товар,ДатаДокумента)Экспорт 

	Результат = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Товар) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ТаблицаТЧ = Объект.Товары.Выгрузить(); 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	ТаблицаТЧ.СрокГодности КАК СрокГодности,
	|	ТаблицаТЧ.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_ТЧ_1
	|ИЗ
	|	&ТаблицаТЧ КАК ТаблицаТЧ
	|ГДЕ
	|	ТаблицаТЧ.НаименованиеТовара = &ТоварПарам
	|	И ТаблицаТЧ.СрокГодности <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ_1.СрокГодности КАК СрокГодности,
	|	СУММА(ВТ_ТЧ_1.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	ВТ_ТЧ_1 КАК ВТ_ТЧ_1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТЧ_1.СрокГодности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеОстаткиОстатки.СрокГодности КАК СрокГодности
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(&Момент, Товар = &ТоварПарам) КАК СвободныеОстаткиОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТЧ КАК ВТ_ТЧ
	|		ПО СвободныеОстаткиОстатки.СрокГодности = ВТ_ТЧ.СрокГодности
	|ГДЕ
	|	ЕСТЬNULL(СвободныеОстаткиОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_ТЧ.Количество, 0) > 0";
	
	ГраницаКонтроля = Новый Граница(КонецДня(ДатаДокумента), ВидГраницы.Включая);
   	
	// Передаем ТЧ в запрос как параметр
    Запрос.УстановитьПараметр("ТаблицаТЧ", ТаблицаТЧ);
    Запрос.УстановитьПараметр("ТоварПарам", Товар);
    Запрос.УстановитьПараметр("Момент", ГраницаКонтроля);

    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Результат.Добавить(Выборка.СрокГодности);
    КонецЦикла;
    
    Возврат Результат;
	
КонецФункции
	
	
// Загружаем массив сроков в список выбора
&НаКлиенте
Процедура ТоварыСрокГодностиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	Строка = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(Строка.НаименованиеТовара) Тогда
		Сообщить ("Не выбран товар.");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	МассивСроков = ПолучитьДоступныеСрокиГодности(Строка.НаименованиеТовара, Объект.Дата);
	
	Если МассивСроков.Количество () = 0 Тогда
		Сообщить ("По товару нет партий в наличии.");
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли; 
	
	ЭтаФорма.Элементы.ТоварыСрокГодности.СписокВыбора.ЗагрузитьЗначения(МассивСроков);
	СтандартнаяОбработка = Истина;
	
КонецПроцедуры



//-Автозаполнение цены-
&НаСервере
Функция ПолучитьПоследнююЦену(Товар, Момент)Экспорт
	
	Если НЕ ЗначениеЗаполнено(Товар) Тогда
		Возврат 0;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИсторияЦенПродажиСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ИсторияЦенПродажи.СрезПоследних(&Момент) КАК ИсторияЦенПродажиСрезПоследних
	|ГДЕ
	|	ИсторияЦенПродажиСрезПоследних.Товар = &Товар";
	
	Запрос.УстановитьПараметр("Момент", Момент);
	Запрос.УстановитьПараметр("Товар", Товар);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;	
	
КонецФункции

&НаКлиенте
Процедура ТоварыНаименованиеТовараПриИзменении(Элемент)
	
	Строка = Элементы.Товары.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(Строка.НаименованиеТовара) Тогда
		Строка.Цена = 0;
		Строка.Сумма = 0;
		Возврат;
	КонецЕсли;  
	
	Момент = КонецДня(Объект.Дата);
	
	Цена =	ПолучитьПоследнююЦену(Строка.НаименованиеТовара, Момент);
	
	Если Цена = 0 Тогда
		Строка.Цена = 0;
		Строка.Сумма = 0;
		
		Сообщить ("Для товара " + Строка.НаименованиеТовара + " нет сохранённой цены. Заполните цену вручную.");
		Возврат;
	КонецЕсли;
	
	Строка.Цена = Цена;
	Строка.Сумма = Окр (Строка.Количество * Строка.Цена,2);
		
КонецПроцедуры


